[
    {
      "input": "Neighbourhood: Agincourt North (129) - Assault: Low, Auto Theft: Medium, Break and Enter: Low, Robbery: Medium",
      "output": "Agincourt North has varying safety risks: Assault (Low), Auto Theft (Medium), Break and Enter (Low), and Robbery (Medium). ␃ Which crime types would you like to focus on, and do you have specific concerns about commuting or feeling safe during late hours?"
    },
    {
      "input": "Selected Crime Types: Auto Theft, Robbery\nConcerned About Commuting: Yes\nSecure During Late Hours: No",
      "output": "You selected Auto Theft and Robbery and expressed concerns about commuting and feeling unsafe during late hours. ␃ How do you typically travel around the neighborhood, and do you take measures such as locking valuables or using safety apps?"
    },
    {
      "input": "Transportation Method: Car\nValuables Locked Out of Sight: Yes\nSafety Apps: No",
      "output": "You primarily use a car, keep valuables locked out of sight, but don’t use safety apps. ␃ Would you consider additional security features for your vehicle, and do you have interest in local safety initiatives or defensive driving courses?"
    },
    {
      "input": "Neighbourhood: Agincourt South-Malvern West (128) - Break and Enter: Medium, Robbery: Medium",
      "output": "Break and Enter and Robbery are both medium risk in Agincourt South-Malvern West. ␃ What home security measures have you implemented, and do you think outdoor lighting could improve your safety?"
    },
    {
      "input": "Home Security Measures: Security Cameras, Deadbolts\nOutdoor Areas Well-Lit: No",
      "output": "You have security cameras and deadbolts but no outdoor lighting. ␃ Are there other security features you’re considering, and do you feel a community watch would benefit your neighborhood?"
    },
    {
      "input": "Neighbourhood: Annex (95) - Assault: High, Break and Enter: High",
      "output": "Both Assault and Break-In risks are high in Annex. ␃ When do you feel most at risk, and do you leave any entry points, such as windows, vulnerable?"
    },
    {
      "input": "Time of Day Most at Risk: Late Night\nWindows Open for Ventilation: Yes",
      "output": "You feel most at risk late at night and leave windows open for ventilation. ␃ What specific security improvements would help you feel safer, and are there particular safety strategies you’d like to explore?"
    }
  ]
  