[
    {
        "input": "I'm worried about my safety when using public transit in my neighborhood.\nNeighbourhood Safety Score: High\n",
        "output": "For high-risk areas, transit safety means sticking to well-populated routes, avoiding isolated stations, and using safety apps to share your location. ␃ Refine your safety plan by selecting your usual transit times (morning, afternoon, night) and indicating any specific concerns like dimly lit stops or feeling unsafe during transfers."
    },
    {
        "input": "What are the best ways to secure my home from breaking and entering?\nNeighbourhood Safety Score: Medium\n",
        "output": "In medium-risk neighborhoods, home security can be enhanced with smart locks, motion-sensor lights, and neighborhood watch involvement. Surveillance systems are a good consideration as well. ␃ Share your home’s key features, like having multiple entry points or vulnerable windows, and whether you prefer DIY or professional security solutions."
    },
    {
        "input": "Neighbourhood Safety Score: Medium\nCar Parking Location: ['Street']\nSecurity Concerns: ['Car Theft', 'Vandalism']\n",
        "output": "Street parking in a medium-risk area exposes your car to theft and vandalism. Use deterrents like a steering wheel lock, park under bright streetlights, and consider a dash cam. ␃ Would you like advice on specific anti-theft devices, or do you want to learn about local community safety initiatives to reduce vehicle crime?"
    },
    {
        "input": "Neighbourhood Safety Score: High\nVacation Duration: ['2 Weeks']\nHome Protection Measures: ['Light Timers', 'Neighbor Check-ins']\n",
        "output": "For a two-week vacation in a high-risk area, additional precautions like monitored alarm systems and video surveillance can help secure your home. Light timers and neighbor check-ins are a great start. ␃ Do you need recommendations for alarm services or tips on safeguarding specific vulnerable points like windows and back doors?"
    }
]
