[
    {
      "input": "Neighbourhood: Agincourt North (129) - Assault: Low, Auto Theft: Medium, Break and Enter: Low, Robbery: Medium",
      "output": "Agincourt North has varying safety risks: Assault (Low), Auto Theft (Medium), Break and Enter (Low), and Robbery (Medium). ␃ Which crime types would you like to focus on, and do you have specific concerns about how these risks impact your daily activities?"
    },
    {
      "input": "Selected Crime Types: Auto Theft, Robbery\nConcerns About Daily Activities: Yes",
      "output": "You selected Auto Theft and Robbery and indicated that these risks affect your daily activities. ␃ How do these concerns shape your routines, such as your commuting methods or precautions you take when traveling or parking?"
    },
    {
      "input": "Commuting Method: Car\nPrecautions Taken: Locking Valuables, Avoiding Isolated Areas",
      "output": "You commute by car and take precautions like locking valuables and avoiding isolated areas. ␃ Are there additional measures you feel could improve your sense of safety, and do you consider your current strategies effective?"
    },
    {
      "input": "Neighbourhood: Agincourt South-Malvern West (128) - Break and Enter: Medium, Robbery: Medium",
      "output": "Break and Enter and Robbery are both medium risk in Agincourt South-Malvern West. ␃ What specific home security practices do you currently use, and are there areas where you feel your safety could be enhanced?"
    },
    {
      "input": "Current Practices: Deadbolts, Window Locks\nAreas for Improvement: Outdoor Lighting",
      "output": "You have deadbolts and window locks but feel outdoor lighting could be improved. ␃ Are there any additional security features you’re considering, and how do you assess the overall safety of your neighborhood?"
    },
    {
      "input": "Neighbourhood: Annex (95) - Assault: High, Break and Enter: High",
      "output": "Both Assault and Break-In risks are high in Annex. ␃ When do you feel most vulnerable in your neighborhood, and do you take specific precautions during those times?"
    },
    {
      "input": "Vulnerable Times: Late Night\nPrecautions: Walking with a Group, Avoiding Dark Areas",
      "output": "You feel most vulnerable late at night and take precautions like walking with a group and avoiding dark areas. ␃ Are there other situations or locations where you feel at risk, and do you have any additional safety concerns?"
    }
]
  